================================================================================
Comment followed by line continuation
================================================================================

program test
    write(*, "('Testing line continuation')", &
       &  advance='no', &  ! Comment after line continuation
       &  iostat=istat)
end program

--------------------------------------------------------------------------------

(translation_unit
  (program
    (program_statement
      (name)
      (end_of_statement))
    (write_statement
      (unit_identifier)
      (format_identifier
        (prefixed_string_literal
          (string_literal)))
      (keyword_argument
        (identifier)
        (prefixed_string_literal
          (string_literal)))
      (comment)
      (keyword_argument
        (identifier)
        (identifier)))
    (end_of_statement)
    (end_program_statement
      (end_of_statement))))

================================================================================
Line continuations with comment and blank lines
================================================================================

program test
    write(*, "('Testing line continuation')", &
       ! comment
       &  advance='no', &


       &  iostat=istat  &


       )
end program

--------------------------------------------------------------------------------

(translation_unit
  (program
    (program_statement
      (name)
      (end_of_statement))
    (write_statement
      (unit_identifier)
      (format_identifier
        (prefixed_string_literal
          (string_literal)))
      (comment)
      (keyword_argument
        (identifier)
        (prefixed_string_literal
          (string_literal)))
      (keyword_argument
        (identifier)
        (identifier)))
    (end_of_statement)
    (end_program_statement
      (end_of_statement))))

================================================================================
Line continuation before comma
================================================================================

program test
  integer :: foo & ! comment
    , bar
end program test

--------------------------------------------------------------------------------

(translation_unit
  (program
    (program_statement
      (name)
      (end_of_statement))
    (variable_declaration
      (intrinsic_type)
      (identifier)
      (comment)
      (identifier))
    (end_of_statement)
    (end_program_statement
      (name)
      (end_of_statement))))

================================================================================
Line continuation before function suffix
================================================================================

program test
contains
  function foo( &
    bar) &  ! comment
  result(res)
    integer :: bar
  end function foo
end program test

--------------------------------------------------------------------------------

(translation_unit
  (program
    (program_statement
      (name)
      (end_of_statement))
    (internal_procedures
      (contains_statement)
      (end_of_statement)
      (function
        (function_statement
          (name)
          (parameters
            (identifier))
          (comment)
          (function_result
            (identifier))
          (end_of_statement))
        (variable_declaration
          (intrinsic_type)
          (identifier))
        (end_of_statement)
        (end_function_statement
          (name)
          (end_of_statement))))
    (end_program_statement
      (name)
      (end_of_statement))))

================================================================================
Empty Write with FMT
================================================================================

program test
    write(*, 1)

1  format('hello')
end program

--------------------------------------------------------------------------------

(translation_unit
  (program
    (program_statement
      (name)
      (end_of_statement))
    (write_statement
      (unit_identifier)
      (format_identifier
        (statement_label_reference)))
    (end_of_statement)
    (statement_label)
    (format_statement
      (transfer_items
        (string_literal)))
    (end_of_statement)
    (end_program_statement
      (end_of_statement))))

================================================================================
Inline comments
================================================================================

!comment
PROGRAM TEST
    int_val = 1     ! comment
    int_val = 1_SZ1 ! comment
contains ! comment
   subroutine foo() ! comment
   end subroutine foo ! comment
end program ! comment
! comment

--------------------------------------------------------------------------------

(translation_unit
  (comment)
  (program
    (program_statement
      (name)
      (end_of_statement))
    (assignment_statement
      (identifier)
      (number_literal))
    (end_of_statement)
    (comment)
    (assignment_statement
      (identifier)
      (number_literal
        (identifier)))
    (end_of_statement)
    (comment)
    (internal_procedures
      (contains_statement)
      (end_of_statement)
      (comment)
      (subroutine
        (subroutine_statement
          (name)
          (end_of_statement))
        (comment)
        (end_subroutine_statement
          (name)
          (end_of_statement))))
    (comment)
    (end_program_statement
      (end_of_statement)))
  (comment)
  (comment))

================================================================================
Line continuation in concat string
================================================================================

program test
  print*, "12&bar"
  print*, "&
    &hello"
  print*, "this is "&
    &"one string"
  print*, "this is "&
    & // "two strings"
  print*, "this is "&
    , "two strings"
end program

--------------------------------------------------------------------------------

(translation_unit
  (program
    (program_statement
      (name)
      (end_of_statement))
    (print_statement
      (format_identifier)
      (output_item_list
        (prefixed_string_literal
          (string_literal))))
    (end_of_statement)
    (print_statement
      (format_identifier)
      (output_item_list
        (prefixed_string_literal
          (string_literal))))
    (end_of_statement)
    (print_statement
      (format_identifier)
      (output_item_list
        (prefixed_string_literal
          (string_literal))))
    (end_of_statement)
    (print_statement
      (format_identifier)
      (output_item_list
        (concatenation_expression
          (prefixed_string_literal
            (string_literal))
          (prefixed_string_literal
            (string_literal)))))
    (end_of_statement)
    (print_statement
      (format_identifier)
      (output_item_list
        (prefixed_string_literal
          (string_literal))
        (prefixed_string_literal
          (string_literal))))
    (end_of_statement)
    (end_program_statement
      (end_of_statement))))

================================================================================
Line continuation in hollerith constants
================================================================================
program test
1 format(6x, 10habcdef,&
    &ghi)
2 format(6x, 1&
    &0habcdefghik)
3 format(6x, 10&
    &habcdefghik)
end program

--------------------------------------------------------------------------------

(translation_unit
  (program
    (program_statement
      (name)
      (end_of_statement))
    (statement_label)
    (format_statement
      (transfer_items
        (edit_descriptor)
        (hollerith_constant)))
    (end_of_statement)
    (statement_label)
    (format_statement
      (transfer_items
        (edit_descriptor)
        (hollerith_constant)))
    (end_of_statement)
    (statement_label)
    (format_statement
      (transfer_items
        (edit_descriptor)
        (hollerith_constant)))
    (end_of_statement)
    (end_program_statement
      (end_of_statement))))

================================================================================
Line continuation immediately after number literal
================================================================================
program test
  integer :: b(3) = (/&
  1, &
  2, &
  3&
  /)
end program test
--------------------------------------------------------------------------------

(translation_unit
  (program
    (program_statement
      (name)
      (end_of_statement))
    (variable_declaration
      (intrinsic_type)
      (init_declarator
        (sized_declarator
          (identifier)
          (size
            (number_literal)))
        (array_literal
          (number_literal)
          (number_literal)
          (ERROR
            (number_literal)))))
    (end_of_statement)
    (end_program_statement
      (name)
      (end_of_statement))))
